
/* Class = "NSButtonCell"; title = "Yes, I accept these risks"; ObjectID = "EzI-6V-u2P"; */
"EzI-6V-u2P.title" = "Ja, ich nehme die Risiken in Kauf";

/* Class = "NSTextFieldCell"; title = "Apple makes significant changes to macOS in every upgrade. To continue providing reliable and safe backups, we must modify and test CCC against new OS releases to accommodate changes in the operating system and the filesystem. This is not a trivial procedure, we spend weeks performing hundreds of tests against the new OS.\n\nIf you continue to use this version of CCC on this OS, your backups could be incomplete, non-functional, unreliable, or, at worst, an OS change could cause CCC to work in an unpredictable manner. \n\nCCC has the privilege and capacity to DELETE data. While we do not anticipate that future OS changes would lead CCC to cause harm to your system or data, it is impossible for us to predict that. If you continue to use this untested version of CCC on this new OS, are you willing to accept these potential risks to your data?"; ObjectID = "PTM-A4-tAM"; */
"PTM-A4-tAM.title" = "Apple nimmt mit jedem macOS Upgrade erhebliche Änderungen am Betriebssystem vor. Um auch weiterhin zuverlässige und sichere Backups anbieten zu können, müssen wir CCC verändern und mit neuen Betriebssystemversionen testen, um die Modifikationen am Betriebssystem und Dateisystem einzubeziehen. Dies ist keine leichte Aufgabe. Wir verbringen Wochen mit hunderten von Tests zur neuen Version.\n\nWenn Sie CCC mit dieser Betriebssystem-Version weiterhin verwenden möchten, könnten Ihre Backups unvollständig, nicht funktionstüchtig, oder unzuverlässig sein. Im schlimmsten Fall kann das Verhalten von CCC selbst unberechenbar werden.\n\nCCC verfügt über Rechte zum LÖSCHEN von Daten. Und auch wenn wir nicht davon ausgehen, dass CCC bei künftigen Versionen von macOS Schäden an Ihrem System anrichtet, ist dies doch unmöglich vorherzusehen. Wenn Sie also weiterhin diese ungeprüfte Version von CCC auf dem neuen macOS verwenden möchten, sind Sie bereit, diese möglichen Risiken für Ihre Daten einzugehen?";

/* Class = "NSButtonCell"; title = "No, show me the update options"; ObjectID = "zs0-Dc-0nt"; */
"zs0-Dc-0nt.title" = "Nein, zeig mir die Update-Optionen";
